app/Models/ModelHalte.php

    public function getHalte()
    {
        return $this->where('deleted', 0)->findAll();
---
SELECT *
FROM "halte"
WHERE "deleted" = 0